Revit 2024 API
StructuralAsset.WoodPerpendicularCompressionStrength Property
 The perpendicular compression strength of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double WoodPerpendicularCompressionStrength { get; set; }
Visual Basic
Public Property WoodPerpendicularCompressionStrength As Double
	Get
	Set
Visual C++
public:
property double WoodPerpendicularCompressionStrength {
	double get ();
	void set (double value);
}
Remarks
 Applies to wood-based structural assets. The value is in Newtons per foot meter (N/(ft · m)).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InapplicableDataException |  When setting this property: the material type must be wood to set this property.
See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace